Revit 2027 API
ParameterTypeId.CurtainWallPanelHostId Property
 "Host Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurtainWallPanelHostId { get; }
Public Shared ReadOnly Property CurtainWallPanelHostId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurtainWallPanelHostId {
	ForgeTypeId^ get ();
}
static member CurtainWallPanelHostId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace